# Sammie Bever

# 7.14.2 DataFrames

In [38]:
import pandas as pd

In [39]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

In [41]:
grades = pd.DataFrame(grades_dict)

In [42]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [44]:
grades.index = ['Test1', 'Test2', 'Test3']

In [45]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [46]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [47]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [48]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [49]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [50]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [51]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [52]:
grades.loc[['Test1', 'Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [53]:
grades.iloc[[0,2]]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [55]:
grades.loc['Test1':'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [56]:
grades.iloc[[0, 2], 0:3]

       Wally  Eva  Sam
Test1     87  100   94
Test3     70   90   90

In [57]:
grades[grades >= 90]

       Wally    Eva   Sam  Katie  Bob
Test1    NaN  100.0  94.0  100.0  NaN
Test2   96.0    NaN   NaN    NaN  NaN
Test3    NaN   90.0  90.0    NaN  NaN

In [58]:
grades[(grades >= 80) & (grades < 90)]

       Wally   Eva  Sam  Katie   Bob
Test1   87.0   NaN  NaN    NaN  83.0
Test2    NaN  87.0  NaN   81.0   NaN
Test3    NaN   NaN  NaN   82.0  85.0

In [59]:
grades.at['Test2', 'Eva']

87

In [60]:
grades.iat[2, 0]

70

In [61]:
grades.at['Test2', 'Eva']

87

In [63]:
grades.at['Test2', 'Eva']

87

In [64]:
grades.iat[1, 2] = 87

In [65]:
grades.iat[1, 2]

87

In [67]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  90.333333   87.666667  77.666667
std    13.203535    6.806859   3.511885   10.692677  11.015141
min    70.000000   87.000000  87.000000   81.000000  65.000000
25%    78.500000   88.500000  88.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [68]:
pd.set_option('precision', 2)

In [69]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  90.33   87.67  77.67
std    13.20    6.81   3.51   10.69  11.02
min    70.00   87.00  87.00   81.00  65.00
25%    78.50   88.50  88.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [70]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      90.33
Katie    87.67
Bob      77.67
dtype: float64

In [71]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     87     90
Katie    100     81     82
Bob       83     65     85

In [72]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00    5.0   5.00
mean    92.80   83.2  83.40
std      7.66   11.5   8.23
min     83.00   65.0  70.00
25%     87.00   81.0  82.00
50%     94.00   87.0  85.00
75%    100.00   87.0  90.00
max    100.00   96.0  90.00

In [73]:
grades.T.mean()

Test1    92.8
Test2    83.2
Test3    83.4
dtype: float64

In [74]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   87     81   65
Test1     87  100   94    100   83

In [75]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   87     96
Test3   85   90     82   90     70

In [76]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2   87     81   87     96   65
Test3   90     82   90     70   85

In [77]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100     87     90
Katie    100     81     82
Sam       94     87     90
Wally     87     96     70
Bob       83     65     85

In [78]:
grades.loc['Test1'].sort_values(ascending=False)

Eva      100
Katie    100
Sam       94
Wally     87
Bob       83
Name: Test1, dtype: int64

# Sammie Bever

In [80]:
import pandas as pd

In [81]:
temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

In [82]:
temperatures = pd.DataFrame(temps, index=['Low', 'High'])

In [83]:
temperatures

      Mon  Tue  Wed  Thu  Fri
Low    68   71   66   75   62
High   89   93   82   97   79

In [84]:
temperatures.loc[:, 'Mon':'Wed']

      Mon  Tue  Wed
Low    68   71   66
High   89   93   82

In [85]:
temperatures.loc['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fri    62
Name: Low, dtype: int64

In [87]:
pd.set_option('precision', 2)

In [88]:
temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64

In [89]:
temperatures.mean(axis=1)

Low     68.4
High    88.0
dtype: float64

# Sammie Bever